Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: Because you want all your branches and tags to go up, you can now run this:
cs: Protože do něj chcete odeslat všechny své větve a značky, můžete použít příkaz:

source: Because your starting point is the `ca82a6` commit object you saw in the `info/refs` file, you start by fetching that:
cs: Protože je vaším výchozím bodem objekt revize `ca82a6`, jak jste zjistili v souboru `info/refs`, začnete vyzvednutím tohoto objektu:

source: Before a topic branch merge.
cs: Před začleněním tematické větve

source: Before the last commit, you were using closer to 2K — clearly, removing the file from the previous commit didn’t remove it from your history.
cs: Před zapsáním poslední revize jste využívali přibližně 2 kB. Je tedy jasné, že odstranění souboru z předchozí revize ho neodstranilo z historie.

source: Before we finish this chapter on basic Git, a few little tips and tricks may make your Git experience a bit simpler, easier, or more familiar.
cs: Než ukončíme tuto kapitolu věnovanou základům práce se systémem Git, přidáme ještě pár tipů a triků, které vám mohou usnadnit či zpříjemnit práci.

source: Before you start looking at the specific use cases, here’s a quick note about commit messages.
cs: Než se podíváme na konkrétní praktické příklady, přidávám malou poznámku o zprávách k revizím.

source: Behind big corporate firewalls, this obscure port is commonly blocked.
cs: Velkými podnikovými firewally je tento málo rozšířený port většinou blokován.

source: Benevolent dictator workflow.
cs: Pracovní postup s benevolentním diktátorem

source: Better get rid of it:
cs: Raději se ho zbavme:

source: Boom.
cs: Šup!

source: Both files are staged and will go into your next commit.
cs: Oba soubory jsou nyní připraveny k zapsání a budou zahrnuty do příští revize.

source: Both of those changes are isolated in separate branches: you can switch back and forth between the branches and merge them together when you’re ready.
cs: Oboje tyto změny jsou oddělené na samostatných větvích. Můžete mezi nimi přepínat tam a zpět, a až uznáte za vhodné, můžete je sloučit.

source: Branch pointing into the commit data’s history.
cs: Větev ukazující do historie dat revizí

source: Branches on this list without the `*` in front of them are generally fine to delete with `git branch -d`; you’ve already incorporated their work into another branch, so you’re not going to lose anything.
cs: Větve v tomto seznamu, které nejsou označeny `*`, lze většinou snadno smazat příkazem `git branch -d`. Jejich obsah už jste převzali do jiné větve, a tak jejich odstraněním nepřijdete o žádnou práci.

source: Branching in Subversion isn’t the same as branching in Git; if you can avoid using it much, that’s probably best.
cs: Princip větvení v systému Subversion se odlišuje od větvení v systému Git. Pravděpodobně nejlepší bude, když se mu pokusíte co nejvíc vyhýbat.

source: Branching means you diverge from the main line of development and continue to do work without messing with that main line.
cs: Větvení znamená, že se můžete odloučit od hlavní linie vývoje a pokračovat v práci, aniž byste hlavní linii zanášeli smetím.

source: But because Git was initially a toolkit for a VCS rather than a full user-friendly VCS, it has a bunch of verbs that do low-level work and were designed to be chained together UNIX style or called from scripts.
cs: Protože však byl Git původně spíš soupravou nástrojů k verzování než plným, uživatelsky přívětivým systémem VCS, zná celou řadu příkazů pracujících na nižších úrovních, které byly původně spojovány ve stylu UNIXu nebo volány ze skriptů.

source: But enforcing this with a hook will also work, and you can modify it to do so only for certain users or whatever else you come up with later.
cs: Pokud však totéž nastavíte pomocí zásuvného modulu, pochodíte i ve starších verzích systému Git a navíc ho můžete nastavit pouze pro konkrétní uživatele nebo na cokoli jiného, s čím se kdy setkáte.

source: But in Git it’s common to create, work on, merge, and delete branches several times a day.
cs: V systému Git naopak není výjimkou vytvářet, používat, slučovat a mazat větve i několikrát denně.

source: But in this chapter, you’ll be dealing mostly with the lower-level plumbing commands, because they give you access to the inner workings of Git and help demonstrate how and why Git does what it does.
cs: V této kapitole se však budeme věnovat převážně nízkoúrovňovým příkazům, protože ty vám umožní nahlédnout do vnitřního fungování systému Git a pochopit, jak a proč Git dělá to, co dělá.

source: But instead of appending them manually to the `~/.ssh/authorized_keys` file on your server, you’ll add them, one key per file, into the `keydir` directory.
cs: Ale místo toho, abyste je vkládali ručně do souboru `~/.ssh/authorized_keys` na serveru, přidáte je do adresáře `keydir`, jeden soubor pro každý klíč.

source: But it’s possible that the patch won’t apply cleanly.
cs: Může se ale stát, že záplata nebude aplikována čistě.

source: But notice that only the origin remote is an SSH URL, so it’s the only one I can push to (we’ll cover why this is in _Chapter 4_.
cs: Ale všimněte si, že pouze vzdálený server origin je SSH URL, a je tedy jediným repozitářem, kam lze soubory odesílat (push; důvod objasníme v _kapitole 4_.

source: But remembering the SHA-1 key for each version of your file isn’t practical; plus, you aren’t storing the filename in your system — just the content.
cs: Pamatovat si klíč SHA-1 každé verze souboru ale není praktické, navíc v systému neukládáte název souboru, pouze jeho obsah.

source: But suppose you didn’t; how would you identify what file or files were taking up so much space?
cs: Můžeme ale předpokládat, že to nevíte. Jak se dá zjistit, který soubor nebo soubory zabírají tolik místa?

source: But the question is how do you convert _binary_ data to a text?
cs: Ale otázkou je, jak byste měli konverzi _binárních_ dat na text provést?

source: But those are the only two differences — otherwise, the script works the same way.
cs: Toto jsou však jediné dvě změny, v ostatních ohledech pracuje skript stejně.

source: But you have already set up your repositories in `/opt/git`, so instead of reconfiguring everything, you create a symlink:
cs: Vy už však máte repozitáře vytvořeny ve složce `/opt/git`, a tak místo toho, abyste museli vše překonfigurovat, vytvoříte symbolický odkaz:

source: But you need to provide a descriptive commit message (via `-m`), or the merge will say "Merge branch opera" instead of something useful.
cs: Měli byste však uvést výstižnou zprávu revize (pomocí parametru `-m`). V opačném případě bude sloučení místo užitečných informací oznamovat jen „Merge branch opera“ („začleněna větev opera“).

source: By blaming `GITPackUpload.m` with the `-C` option, I could see where sections of the code originally came from:
cs: Když jsem zadal příkaz `GITPackUpload.m` s parametrem `-C`, dostal jsem informace, odkud původně pocházejí jednotlivé kousky kódu:

source: By convention, bare repository directories end in `.git`, like so:
cs: Je zvykem, že adresáře s holým repozitářem končí na `.git`, například:

source: By default, Git doesn’t check for consistency all the objects it receives during a push.
cs: Git ve výchozím nastavení nekontroluje konzistenci všech objektů, které přijímá při odesílání dat.

source: By default, Git passes the following arguments to the diff program:
cs: Standardně Git předává do nástoje diff tyto parametry:

source: By default, Git populates this directory with a bunch of example scripts, many of which are useful by themselves; but they also document the input values of each script.
cs: Git do tohoto adresáře standardně ukládá několik ukázkových skriptů, které jsou často užitečné nejen samy o sobě, ale navíc dokumentují vstupní hodnoty všech skriptů.

source: By default, Git uses whatever you’ve set as your default text editor or else falls back to the Vi editor to create and edit your commit and tag messages.
cs: Git používá k vytváření a editaci zpráv k revizím a značkám standardně textový editor, který nastavíte jako výchozí, nebo použije editor Vi.

source: By default, Git uses your system’s default editor, which is generally Vi or Vim.
cs: Pokud toto nastavení nezměníte, bude Git používat výchozí editor vašeho systému, jímž je většinou Vi nebo Vim.

source: By default, a user’s SSH keys are stored in that user’s `~/.ssh` directory.
cs: Uživatelské SSH klíče jsou standardně uloženy v adresáři `~/.ssh` daného uživatele.

source: By default, the `git push` command doesn’t transfer tags to remote servers.
cs: Příkaz `git push` nepřenáší značky na vzdálené servery automaticky.

source: By default, with no arguments, `git log` lists the commits made in that repository in reverse chronological order.
cs: Ve výchozím nastavení a bez dalších parametrů vypíše příkaz `git log` revize provedené v daném repozitáři v obráceném chronologickém pořadí.

source: By now, you’ve learned most of the day-to-day commands and workflows that you need to manage or maintain a Git repository for your source code control.
cs: Do této chvíle jste stačili poznat většinu každodenních příkazů a pracovních postupů, které budete při práci se zdrojovým kódem potřebovat k ovládání a správě repozitáře Git.

source: By private, I mean closed source — not read-accessible to the outside world.
cs: Soukromým projektem myslím uzavřený zdrojový kód – okolní svět k němu nemá oprávnění pro čtení.

source: By symbolic reference, I mean that unlike a normal reference, it doesn’t generally contain a SHA-1 value but rather a pointer to another reference.
cs: Symbolickou referencí myslím to, že na rozdíl od normálních referencí většinou neobsahuje hodnotu SHA-1, ale spíš ukazatel na jinou referenci.

source: By the end of the chapter, you should be able to configure and initialize a repository, begin and stop tracking files, and stage and commit changes.
cs: Po přečtení kapitoly byste měli být schopni nakonfigurovat a inicializovat repozitář, spustit a ukončit sledování souborů, připravovat soubory a zapisovat revize.

source: Centralized version control diagram.
cs: Diagram centralizované správy verzí

source: Centralized workflow.
cs: Centralizovaný pracovní postup

source: Change `/bin/sh` to `/usr/bin/git-shell` (or run `which git-shell` to see where it’s installed).
cs: Změňte `/bin/sh` na `/usr/bin/git-shell` (nebo spusťte příkaz `which git-shell`, abyste viděli, kde je nainstalován).

source: Change the commit message, and exit the editor.
cs: Změňte zprávu k revizi a zavřete textový editor.

source: Changes are shown inline instead.
cs: Místo toho se změny zobrazují uvnitř textu.

source: Changes you submit may be rendered obsolete or severely broken by work that is merged in while you were working or while your changes were waiting to be approved or applied.
cs: U změn, které postoupíte vyšší instanci, může docházet k zastarávání nebo vážnému narušení jinými daty, která byla začleněna během vaší práce nebo ve chvíli, kdy vaše změny čekaly na schválení či aplikaci.

source: Changing your last commit is probably the most common rewriting of history that you’ll do.
cs: Změna poslední revize je pravděpodobně nejobvyklejším způsobem přepsání historie, který budete provádět.

source: Chapter 6 describes a number of useful Git tricks for rewriting history and interactively staging files — use these tools to help craft a clean and understandable history.
cs: Kapitola 6 popisuje několik užitečných triků, jak v systému Git přepsat historii a jak interaktivně připravovat soubory k zapsání. Používejte tyto nástroje k udržení čisté a srozumitelné historie.

source: Check the tree created by that commit, and you see something interesting:
cs: Prohlédněte si strom vytvořený touto revizí a uvidíte jednu zajímavou věc:

source: Checking out a local branch from a remote branch automatically creates what is called a _tracking branch_.
cs: Checkoutem lokální větve ze vzdálené větve automaticky vytvoříte takzvanou _sledující větev_ (angl. tracking branch).

source: Click the "edit" button in the project header or the Admin tab at the top of the project to reach the Admin page of your GitHub project (see Figure 4-10).
cs: Kliknutím na tlačítko „edit“ v záhlaví projektu nebo na záložce „Admin“ v horní části projektu se dostanete na stránku správy vašeho projektu na serveru GitHub (viz obrázek 4-10).

source: Clicking the "I agree, sign me up" button takes you to your new user dashboard (see Figure 4-4).
cs: Kliknutím na tlačítko „I agree, sign me up“ přejdete na svůj nový uživatelský ovládací panel (viz obrázek 4-4).

source: Clicking the "explain ssh keys" link takes you to detailed instructions on how to do so on all major operating systems.
cs: Kliknutím na odkaz „explain ssh keys“ přejdete na stránku s podrobnými instrukcemi, jak klíč vložit ve všech hlavních operačních systémech.

source: Clone a repository, and base some work on it.
cs: Naklonovali jste repozitář a provedli v něm změny.

source: Collaborating with others involves managing these remote repositories and pushing and pulling data to and from them when you need to share work.
cs: Spolupráce s ostatními uživateli zahrnuje také správu těchto vzdálených repozitářů. Při sdílení práce musíte do těchto repozitářů data odesílat (push) a zase je z nich stahovat (pull).

source: Commit history after featureA work.
cs: Historie revizí s větví featureA

source: Commit history after featureBv2 work.
cs: Historie revizí s větví featureBv2

source: Committed means that the data is safely stored in your local database.
cs: Zapsáno znamená, že jsou data bezpečně uložena ve vaší lokální databázi.

source: Conceptually, most other systems store information as a list of file-based changes.
cs: Většina ostatních systémů ukládá informace jako seznamy změn jednotlivých souborů.

source: Conceptually, the data in your Git repository looks something like Figure 3-1.
cs: Data ve vašem repozitáři Git se dají schematicky znázornit jako na obrázku 3-1.

source: Conceptually, the data that Git is storing is something like Figure 9-1.
cs: Data, která Git ukládá, vypadají v principu jako na obrázku 9-1.

source: Congratulations on being an effective Git developer!
cs: Gratulujeme, nyní je z vás efektivní vývojář v systému Git!

source: Consider an example of doing some work (on `master`), branching off for an issue (`iss91`), working on it for a bit, branching off the second branch to try another way of handling the same thing (`iss91v2`), going back to your master branch and working there for a while, and then branching off there to do some work that you’re not sure is a good idea (`dumbidea` branch).
cs: Uvažujme nyní následující situaci: pracujete na projektu v hlavní větvi (`master`), odvětvíme se z ní k vyřešení jednoho problému (`iss91`), chvíli na něm pracujete, ale vytvoříte ještě další větev, abyste zkusili jiné řešení stejné chyby (`iss91v2`). Pak se vrátíte zpět do hlavní větve, kde pokračujete v práci, a pak dostanete nápad, který by se možná mohl osvědčit, a tak pro něj vytvoříte další větev (`dumbidea`).

source: Contributing to public projects is a bit different.
cs: Přispívání do veřejných projektů se poněkud liší.

source: Contributors don’t have to wait for the project to incorporate their changes — each party can work at their own pace.
cs: Přispěvatelé nemusí čekat, až budou jejich změny začleněny do projektu – každá strana může pracovat svým tempem.

source: Cool — now you have a branch named `recover-branch` that is where your `master` branch used to be, making the first two commits reachable again.
cs: Výborně, nyní máte větev s názvem `recover-branch`, která se nachází na bývalé pozici větve `master`. První dvě revize jsou opět dostupné.

source: Copy this file to your home directory, and add this to your `.bashrc` file:
cs: Soubor nakopírujte tento do vašeho domovského adresáře a do souboru `.bashrc` přidejte:

source: Copy your SSH public key (a file called `~/.ssh/id_rsa.pub` if you did a plain `ssh-keygen` with all the defaults) from your workstation, renaming it to `<yourname>.pub` (we'll use `scott.pub` in our examples).
cs: Z vaší pracovní stanice nakopírujte svůj veřejný SSH klíč (pokud jste spustili `ssh-keygen` s implicitními hodnotami, jde o soubor `~/.ssh/id_rsa.pub`) a přejmenujte jej na `<vasejmeno>.pub` (v příkladech budeme používat `scott.pub`).

source: Create a branch for a new story you’re working on.
cs: Vytvoříte větev pro novou část stránek, v níž budete pracovat.

source: Create a branch to add the hotfix.
cs: Vytvoříte větev pro přidání hotfixu.

source: Create a file `/usr/local/bin/odt-to-txt` (you are free to put it into a different directory) with the following content:
cs: Vytvořte soubor `/usr/local/bin/odt-to-txt` (můžete jej umístit i do jiného adresáře) s následujícím obsahem:

source: Create a file called `users.txt` that has this mapping in a format like this:
cs: Vytvořte soubor `users.txt`, který bude toto mapování obsahovat v následující podobě:

source: Creating a new branch is as quick and simple as writing 41 bytes to a file (40 characters and a newline).
cs: Vytvořit novou větev je právě tak snadné a rychlé jako zapsat 41 bytů do souboru (40 znaků a jeden znak pro nový řádek).

source: Creating a new branch pointer.
cs: Vytvoření nového ukazatele na větev

source: Creating a new repository on GitHub.
cs: Vytvoření nového repozitáře na serveru GitHub

source: Creating an annotated tag in Git is simple.
cs: Vytvoření anotované značky v systému Git je jednoduché.

source: Currently, the majority of open source development projects and a large number of corporate projects use Subversion to manage their source code.
cs: V současné době používá většina projektů vývoje open source softwaru a velká část korporátních projektů ke správě zdrojového kódu systém Subversion.

source: Distributed version control diagram.
cs: Diagram distribuované správy verzí

source: Do as I say, not as I do.
cs: Řiďte se, prosím, podle toho, co říkám, ne podle toho, co dělám.

source: Do some work in that branch.
cs: Vytvoříte práci v této větvi.

source: Do work on a web site.
cs: Pracujete na webových stránkách.

source: Does it even have a policy?
cs: Má k tomu vůbec vyvinutou metodiku?

source: Does the project have a maintainer or integration manager who checks all the patches?
cs: Má projekt svého správce nebo integračního manažera, který kontroluje všechny záplaty?

source: Doing so also puts the diff of your change in the editor so you can see exactly what you did.) When you exit the editor, Git creates your commit with that commit message (with the comments and diff stripped out).
cs: V editoru se pak zobrazí také výstup rozdílů (diff) ke konkrétním změnám a vy přesně uvidíte, co bylo změněno.) Jakmile editor zavřete, Git vytvoří revizi se zprávou, kterou jste napsali (s odstraněnými komentáři a rozdíly).

source: Doing so automatically runs `test-error.sh` on each checked-out commit until Git finds the first broken commit.
cs: Automaticky se spustí `test-error.sh` na všech načtených revizích, dokud Git nenajde první revizi s chybou.

source: Doing so launches your editor of choice.
cs: Po zadání příkazu se otevře vámi zvolený editor.

source: Doing so moves the `iss53` branch forward, because you have it checked out (that is, your HEAD is pointing to it; see Figure 3-12):
cs: S každou novou revizí se větev `iss53` posune vpřed, protože jste provedli její checkout (to znamená, že na ni přepnuli ukazuje HEAD – viz obrázek 3-12):

source: Doing so offers a number of advantages: a hosting site is generally quick to set up and easy to start projects on, and no server maintenance or monitoring is involved.
cs: Toto řešení vám nabízí celou řadu výhod. Hostingové místo má většinou velmi rychlé nastavení, snadno se na něm zakládají projekty a nevyžaduje od vás správu ani monitoring serveru.

source: Doing so will allow pushes from their public keys to work.
cs: Spolupracovníci mohou odesílat data i na základě svých veřejných klíčů.

source: Don’t ever use this command unless you absolutely know that you don’t want the file.
cs: Nikdy tento příkaz nepoužívejte, pokud si nejste zcela jisti, že už daný soubor nebudete potřebovat.

source: Don’t include any commit you’ve already pushed to a central server — doing so will confuse other developers by providing an alternate version of the same change.
cs: Neměňte tímto způsobem žádné revize, které už jste odeslali na centrální server, způsobili byste tím problémy ostatním vývojářům, kteří by se museli potýkat s jinou verzí téže změny.

source: Don’t rewrite your history and try to push again, and don’t push to a parallel Git repository to collaborate with fellow Git developers at the same time.
cs: Nepřepisujte svou historii a nepokoušejte se ji znovu odeslat a neodesílejte revize do paralelního repozitáře Git, přes nějž chcete současně spolupracovat s kolegy používajícími Git.

source: Download it directly from the Git source code at https://github.com/git/git/blob/master/contrib/completion/git-completion.bash .
cs: Stáhněte si jej ze zdrojových textů systému Git z https://github.com/git/git/blob/master/contrib/completion/git-completion.bash.

source: Each developer has committed a few times and merged each other’s work successfully; see Figure 5-10.
cs: Všichni vývojáři zapsali několik revizí a úspěšně začlenili práci ostatních do své – viz obrázek 5-10.

source: Each level overrides values in the previous level, so values in `.git/config` trump those in `/etc/gitconfig`.
cs: Každá úroveň je nadřazená hodnotám úrovně předchozí, takže hodnoty v `.git/config` převládnou nad hodnotami v `/etc/gitconfig`.

source: Each level overwrites values in the previous level, so values in `.git/config` trump those in `/etc/gitconfig`, for instance.
cs: Každá další úroveň přepisuje hodnoty z předchozí úrovně, a tak např. hodnoty v souboru `.git/config` mají přednost před hodnotami v souboru `/etc/gitconfig`.

source: Each line starts with a 4-byte hex value specifying how long the rest of the line is.
cs: Každý řádek začíná 4bytovou hexadecimální hodnotou, která udává, jak dlouhý je zbytek řádku.

source: Each of the three commit objects points to one of the three snapshot trees you created.
cs: Všechny tři tyto objekty revizí ukazují na jeden ze tří stromů snímku, který jste vytvořili.

source: Each of these can be set to `true`, `false`, or `always`:
cs: Každý z příslušných parametrů může nabývat hodnoty na `true` (pravda), `false` (nepravda) nebo `always` (vždy):

source: Each time you commit or change branches, the reflog is updated.
cs: Vždy když zapíšete revizi nebo změníte větve, je reflog aktualizován.

source: Each time you have a new topic branch to merge in (Figure 5-21), you merge it into `develop` (Figure 5-22); then, when you tag a release, you fast-forward `master` to wherever the now-stable `develop` branch is (Figure 5-23).
cs: Pokaždé, když máte novou tematickou větev k začlenění (obrázek 5-21), začleníte ji do větve `develop` (obrázek 5-22). Když poté označujete vydání, posunete větev `master` rychle vpřed do místa, kde je nyní větev `develop` stabilní (obrázek 5-23).

source: Each time, Git will stop, let you amend the commit, and continue when you’re finished.
cs: Git pokaždé zastaví, nechá vás revizi upravit, a až budete hotovi, bude pokračovat.

source: Each version of Git tends to include useful UI enhancements, so getting the latest version is often the best route if you feel comfortable compiling software from source.
cs: Každá další verze systému Git se snaží přidat nová vylepšení uživatelského rozhraní. Použití poslední verze je tedy zpravidla tou nejlepší cestou, samozřejmě pokud vám nedělá problémy kompilace softwaru ze zdrojových souborů.
